liuweisword/NRF52_LOCK/examples/ble_peripheral/ble_app_template/main.c
    err_code = dm_init(&init_param);
    APP_ERROR_CHECK(err_code);

    memset(&register_param.sec_param, 0, sizeof(ble_gap_sec_params_t));

    register_param.sec_param.bond         = SEC_PARAM_BOND;
    register_param.sec_param.mitm         = SEC_PARAM_MITM;
    register_param.sec_param.lesc         = SEC_PARAM_LESC;
    register_param.sec_param.keypress     = SEC_PARAM_KEYPRESS;
    register_param.sec_param.io_caps      = SEC_PARAM_IO_CAPABILITIES;
    register_param.sec_param.oob          = SEC_PARAM_OOB;
    register_param.sec_param.min_key_size = SEC_PARAM_MIN_KEY_SIZE;
    register_param.sec_param.max_key_size = SEC_PARAM_MAX_KEY_SIZE;
    register_param.evt_handler            = device_manager_evt_handler;
    register_param.service_type           = DM_PROTOCOL_CNTXT_GATT_SRVR_ID;

    err_code = dm_register(&m_app_handle, &register_param);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;

    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type               = BLE_ADVDATA_FULL_NAME;//广播时的名称显示
    advdata.include_appearance      = true;
    advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;//蓝牙设备模式
    advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);//UUID
    advdata.uuids_complete.p_uuids  = m_adv_uuids;

    ble_adv_modes_config_t options = {0};
    options.ble_adv_fast_enabled  = BLE_ADV_FAST_ENABLED;//广播类型
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;//广播间隔
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;//广播超时

    err_code = ble_advertising_init(&advdata, NULL, &options, on_adv_evt, NULL);//广播参数
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                                 bsp_event_handler);//初始化


    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);//初始化按键触发模式
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

//////////////////////////////////////////////////
//
//              LED
//
//
//////////////////////////////////////////////////

void local_led_init(void)
{
    LEDS_CONFIGURE(HEART_LED | EVENT_LED);
    LEDS_OFF(HEART_LED | EVENT_LED);
}

///////////////////////////////////////////////////
//
//      uart
//
//////////////////////////////////////////////////

void uart_event_handle(app_uart_evt_t * p_event)
{
    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
    static uint8_t index = 0;
    uint32_t       err_code;

    switch (p_event->evt_type)
    {
        case APP_UART_DATA_READY:
            UNUSED_VARIABLE(app_uart_get(&data_array[index]));
            index++;

            if ((data_array[index - 1] == '\n') || (index >= (BLE_NUS_MAX_DATA_LEN)))
            {
                err_code = ble_nus_string_send(&m_nus, data_array, index);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                   APP_ERROR_CHECK(err_code);
                }
                printf("local: received the uart data!!\r\n");
                index = 0;
            }
            break;

        case APP_UART_COMMUNICATION_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_communication);
            break;

        case APP_UART_FIFO_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_code);
            break;

        default:
            break;
    }
}


void local_uart_init(void)
{
    uint32_t                     err_code;
    const app_uart_comm_params_t comm_params =
    {
        RX_PIN_NUMBER,
        TX_PIN_NUMBER,
        RTS_PIN_NUMBER,
        CTS_PIN_NUMBER,
        APP_UART_FLOW_CONTROL_DISABLED,
        false,
        UART_BAUDRATE_BAUDRATE_Baud115200
    };

    APP_UART_FIFO_INIT( &comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOW,
                       err_code);
    APP_ERROR_CHECK(err_code);
}




////////////////////////////////////////
//  TIMER
///////////////////////////////////

//void log_printf(void * p_context)
void heart_1sec()
{
    LEDS_INVERT(HEART_LED);
}




static void local_timer_init(void)
{
    uint32_t err_code = NRF_SUCCESS;
    err_code = app_timer_create(&m_log_timer,
                                APP_TIMER_MODE_REPEATED,
                                heart_1sec);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_log_timer,
                                APP_TIMER_TICKS(1000,APP_TIMER_PRESCALER),
                                NULL);
	APP_ERROR_CHECK(err_code);
}

void local_button_handler(bsp_event_t event)
{
    uint32_t err_code;
    switch (event)
    {
        case BSP_EVENT_KEY_0:
            LEDS_INVERT(EVENT_LED);
            break;

        case BSP_EVENT_KEY_1:
            LEDS_INVERT(EVENT_LED);
            break;

        case BSP_EVENT_KEY_2:
            LEDS_INVERT(EVENT_LED);
            break;

        case BSP_EVENT_KEY_3:
            LEDS_INVERT(EVENT_LED);
            break;

        default:
            break;
    }
}

static void local_button_init(void)
{
    uint32_t err_code = bsp_init(BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                                 local_button_handler);
    APP_ERROR_CHECK(err_code);
}


void system_clock_init(void)
{

    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);

    nrf_clock_lf_cfg_t clock_lf_cfg = NRF_CLOCK_LFCLKSRC;
    SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, NULL);

}



/**@brief Function for application main entry.
 */
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;

    // Initialize.
    system_clock_init();

    local_led_init();                                                           //init heart led3
    local_uart_init();                                                          //init uart1
    local_timer_init();                                                         //init timer
    local_button_init();                                                    //init button3 init  toggle led2

    //buttons_leds_init(&erase_bonds);//按键和LED灯初始化
	printf("----------------------BT_LOCK----------------------------");
    printf("\r\nUART Start!\r\n");
    printf("\r\nlocal: uart1 init success!!\r\n");

    while(1)
    {
        printf("\r\nlocal: pc end!!\r\n");
        nrf_delay_ms(5000);
    }


    /*
    ble_stack_init();                                                           //蓝牙协议栈初始化
    device_manager_init(erase_bonds);//设备管理初始化
    gap_params_init();//GAP参数初始化
    advertising_init();//广播初始化
    services_init();//服务初始化
    conn_params_init();//更新过程初始化

    // Start execution.

    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);//开始广播
    APP_ERROR_CHECK(err_code);



    // Enter main loop.
    for (;;)
    {
        power_manage();
    }
    */
}


/**
 * @}
 */
